[
    {
        "id": "dr-matthew-neal",
        "name": "Matthew Neal, MD FACS",
        "role": "Faculty Members",
        "image": "matthew-neal.jpg",
        "bio": "Dr. Matthew Neal is a surgeon-scientist with a clinical practice consisting of trauma, emergency general surgery, and surgical critical care as well as a translational research focus on hemostasis and thrombosis. His basic science laboratory studies the mechanisms of trauma-induced coagulopathy (TIC) with a focus on innate immune signaling and platelet function. He is the principal investigator or co-investigator on several ongoing translational efforts in trauma and surgical care and have served as a Trans-Agency Consortium for Trauma Induced Coagulopathy (TACTIC) investigator since inception of the program. He directs the Pittsburgh Trauma and Transfusion Medicine Research Center, which is a coordinating center to leverage collaboration and resources in trauma research.\n\nHe also serves as one of the directors of the Coordinating Center and the co-chair of the in-patient clinical trial committee for the NIH funded Accelerating COVID-19 Therapeutic Interventions and Vaccines 4 (ACTIV-4) pandemic response. He serves as a mentor to numerous students, fellows, and junior faculty, including a recent recipient of an NIGMS Diversity Supplement (3R35GM119526-07S1). His group is also co-leading a DARPA funded initiative to generate a synthetic whole blood analogue, leveraging our expertise in animal modeling and nanomedicine approaches to hemostasis. He also serves as the Chief Medical Officer of Haima Therapeutics, a biotechnology company focused on platelet-inspired therapies."
    },
    {
        "id": "dr-susan-shea",
        "name": "Susan Shea, PhD",
        "role": "Faculty Members",
        "image": "susan-shea.jpg",
        "bio": "Dr. Susan Shea is an Assistant Professor of Surgery and Bioengineering, and her research program is dedicated to investigation of the contributions of platelets to thrombosis and hemostasis, to include efficacy of platelet-specific thrombolytic therapeutic approaches. She has a broad background in bioengineering with specific training and experience in fluid mechanics, in vitro and ex vivo blood flow assay development and validation, flow chamber design and development, hemostasis and thrombosis, and devices. She has developed flow assays to answer specific questions on both the macro and micro scale.\n\nOne current focus of her research program is to elucidate and identify mechanisms of trauma-induced coagulopathy (TIC), to further identify and develop the most efficacious hemostatic resuscitation strategies. To investigate this, she designs and builds microfluidic assays to study hemostasis under flow in robust platforms. Specifically, we have used microfluidic devices designed and implemented in her lab to study TIC, blood products, including having established a collaboration with Dr. Leeper to study pediatric trauma."
    },
    {
        "id": "emily-mihalko",
        "name": "Emily Mihalko, PhD",
        "role": "Faculty Members",
        "image": "emily-mihalko.jpg",
        "bio": "Dr. Emily Mihalko is a Research Assistant Professor in the Department of Surgery at the University of Pittsburgh. She earned her B.S.E. in Bioengineering from the University of Pittsburgh, followed by a Ph.D. in Biomedical Engineering through the joint program at North Carolina State University and the University of North Carolina at Chapel Hill. After completing her doctoral studies, she returned to Pittsburgh for postdoctoral training in thrombosis and hemostasis, which shaped her research focus on clot biology and therapeutic development.\n\nHer work centers on developing targeted therapeutics for thrombotic and bleeding disorders, leveraging both in vivo models and microfluidic systems to study clot formation, platelet function, and fibrinolysis. Dr. Mihalko has contributed to advancing nanoparticle drug delivery systems for conditions such as myocardial infarction, disseminated intravascular coagulation, and stroke. She also plays a key role in research on synthetic platelet technologies and adjunct hemostatic therapies for trauma care, helping bridge translational science and clinical need.\n\nOutside of her research, Dr. Mihalko enjoys creative and active pursuits, including sewing, gardening, making pasta, and running."
    },
    {
        "id": "irona-khandaker",
        "name": "Irona Khandaker, MBBS PhD",
        "role": "Research Scientists & Research Engineers",
        "image": "irona-khandaker.jpg",
        "bio": "Irona Khandaker is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in scientists. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Irona Khandaker collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "pearlson-austin-suthanthiraraj",
        "name": "Pearlson Austin Suthanthiraraj, PhD",
        "role": "Research Scientists & Research Engineers",
        "image": "pearlson-austin-suthanthiraraj.jpg",
        "bio": "Pearlson Austin Suthanthiraraj is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Pearlson Austin Suthanthiraraj collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "abiha-abdullah",
        "name": "Abiha Abdulla, MBBS",
        "role": "Post-doctorates",
        "image": "abiha-abdullah.jpg",
        "bio": "Abiha Abdullah is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in post-doctorates. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Abiha Abdullah collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nAbiha Abdullah has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "bashar-al-matour",
        "name": "Bashar Al Matour, MD",
        "role": "Post-doctorates",
        "image": "bashar-al-matour.jpg",
        "bio": "Bashar Al Matour is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in post-doctorates. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Bashar Al Matour collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nBashar Al Matour has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "rida-zakar",
        "name": "Rida Zakar, MD",
        "role": "Post-doctorates",
        "image": "rida-zakar.jpg",
        "bio": "Rida Zakar is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in post-doctorates. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Rida Zakar collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nRida Zakar has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "garret-campbell",
        "name": "Garrett Campbell, BS",
        "role": "Graduate Students",
        "image": "garrett-campbell.jpg",
        "bio": "Garret Campbell is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Garret Campbell collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nGarret Campbell has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "jack-killinger",
        "name": "Jack Killinger, BS",
        "role": "Graduate Students",
        "image": "jack-killinger.jpg",
        "bio": "Jack Killinger is a Ph.D. student in Bioengineering at the University of Pittsburgh and a researcher in the Thrombosis and Transfusion Medicine Research Lab (TTMRL). He earned his B.S. in Biological Sciences from the University of Pittsburgh, where he first discovered his passion for research through work in chemistry and critical care. After graduation, he worked as a patient care technician in the Surgical Trauma ICU, an experience that deepened his interest in the physiological challenges of critical illness and led him to join TTMRL as a research technician before beginning his doctoral training.\n\nAt TTMRL, Jack’s work focuses on the role of platelet dysfunction in trauma-induced coagulopathy and its downstream effects on immune and endothelial cells. He uses advanced microfluidic platforms, flow cytometry, and animal models to study the dynamics of platelet behavior following severe injury, with the goal of identifying novel therapeutic targets to mitigate long-term complications like organ failure. His projects span pediatric and adult trauma populations and incorporate both molecular analysis and translational modeling. He has presented his work at national and international conferences and is building a strong publication record as he advances toward an academic career in hemostasis and thrombosis research.\n\nOutside of the lab, Jack is currently training for a half Ironman later this year!"
    },
    {
        "id": "kaelyn-mcclain",
        "name": "Kaelyn McClain, BS",
        "role": "Graduate Students",
        "image": "kaelyn-mcclain.jpg",
        "bio": "Kaelyn McClain is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Kaelyn McClain collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "katelin-rahn",
        "name": "Katelin Rahn, BS",
        "role": "Graduate Students",
        "image": "katelin-rahn.jpg",
        "bio": "Katelin Rahn is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Katelin Rahn collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },

    {
        "id": "aishwarrya-arivudainambi",
        "name": "Aishwarrya Arivudainambi, BS",
        "role": "Graduate Students",
        "image": "aishwarrya-arivudainambi.jpg",
        "bio": "Aishwarrya Arivudainambi is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Aishwarrya Arivudainambi collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nAishwarrya Arivudainambi has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "aarushi-bajpai",
        "name": "Aarushi Bajpai, BS",
        "role": "Graduate Students",
        "image": "aarushi-bajpai.png",
        "bio": "Aarushi Bajpai is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Aarushi Bajpai collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nAarushi Bajpai has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "ronit-kar",
        "name": "Ronit “Papai“ Kar, BS",
        "role": "Graduate Students",
        "image": "the-creator.jpg",
        "bio": "Ronit “Papai” Kar is an MS4 medical student in the Physician Scientist Training Program (PSTP) at the University of Pittsburgh School of Medicine, where he is pursuing his M.D. with a focus on basic and translational research. He completed his undergraduate studies at the University of Texas at Austin, earning a B.S. in Biomedical Engineering with honors, concentrating in cellular and biomolecular engineering. Before entering medical school, he worked with the Department of Defense and NASA on life-sustaining systems for divers and astronauts, and holds multiple patents related to medical device innovation.\n\nAt the University of Pittsburgh, Papai conducts research in the TTMRL, where he focuses on platelet dysfunction and vascular biology in the contexts of ischemic stroke and trauma. He is currently leading a project on von Willebrand factor inhibition as a strategy to improve vascular patency, and has spearheaded multiple additional studies examining platelet dysfunction in trauma patients and the interface between hemostasis and immune response. His work utilizes advanced microfluidic models and molecular assays to understand mechanisms of coagulopathy and inform therapeutic development.\n\nOutside of research and clinical training, Papai enjoys playing guitar, hiking, and watching movies."
    },
    {
        "id": "aadhi-arun",
        "name": "Aadhi Arun",
        "role": "Undergraduate Students",
        "image": "aadhi-arun.jpg"
    },
    {
        "id": "grace-ballentine",
        "name": "Grace Ballentine",
        "role": "Undergraduate Students",
        "image": "grace-ballentine.jpg",
        "bio": "Grace Ballentine is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Grace Ballentine collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nGrace Ballentine has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "andrew-chan",
        "name": "Andrew Chan",
        "role": "Undergraduate Students",
        "image": "andrew-chan.jpg",
        "bio": "Andrew Chan is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Andrew Chan collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nAndrew Chan has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "maya-franklin",
        "name": "Maya Franklin",
        "role": "Undergraduate Students",
        "image": "maya-franklin.jpg",
        "bio": "Maya Franklin is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Maya Franklin collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "riya-sharma",
        "name": "Riya Sharma",
        "role": "Undergraduate Students",
        "image": "riya-sharma.jpg",
        "bio": "Riya Sharma is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Riya Sharma collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "zach-nellas",
        "name": "Zach Nellas",
        "role": "Undergraduate Students",
        "image": "zach-nellas.jpg",
        "bio": "Zach Nellas is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in graduate students. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Zach Nellas collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "gnanesh-gutta",
        "name": "Gnanesh Gutta",
        "role": "Research Technicians",
        "image": "gnanesh-gutta.jpg",
        "bio": "Gnanesh Gutta is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Gnanesh Gutta collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "jason-brandon",
        "name": "Jason Brandon",
        "role": "Research Technicians",
        "image": "jason-brandon.jpg",
        "bio": "Jason Brandon is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Jason Brandon collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "juliana-briggs",
        "name": "Juliana Briggs",
        "role": "Research Technicians",
        "image": "juliana-briggs.jpg",
        "bio": "Juliana Briggs is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Juliana Briggs collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "lauren-jackson",
        "name": "Lauren Jackson",
        "role": "Research Technicians",
        "image": "lauren-jackson.jpg",
        "bio": "Lauren Jackson is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Lauren Jackson collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "nick-rocchio-giordano",
        "name": "Nick Rocchio-Giordano",
        "role": "Research Technicians",
        "image": "nick-rocchio-giordano.jpg",
        "bio": "Nick Rocchio-Giordano is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Nick Rocchio-Giordano collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nNick Rocchio-Giordano has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "rob-voinchet",
        "name": "Rob Voinchet",
        "role": "Research Technicians",
        "image": "rob-voinchet.jpg",
        "bio": "Rob Voinchet is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Rob Voinchet collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "slajdana-stratimirovic",
        "name": "Slajdana Stratimirovic",
        "role": "Research Technicians",
        "image": "slajdana-stratimirovic.jpg",
        "bio": "Slajdana Stratimirovic is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Slajdana Stratimirovic collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nSlajdana Stratimirovic has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "tracey-glowacki",
        "name": "Tracey Glowacki",
        "role": "Research Technicians",
        "image": "tracey-glowacki.jpg",
        "bio": "Tracey Glowacki is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Tracey Glowacki collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nTracey Glowacki has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "tvisha-subhasish",
        "name": "Tvisha Subhasish",
        "role": "Research Technicians",
        "image": "tvisha-subhasish.jpg",
        "bio": "Tvisha Subhasish is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in research technicians. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Tvisha Subhasish collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nTvisha Subhasish has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "javonn-musgrove",
        "name": "Javonn Musgrove",
        "role": "Staff",
        "image": "javonn-musgrove.jpg",
        "bio": "Javonn Musgrove is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Javonn Musgrove collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nJavonn Musgrove has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "casey-hicks",
        "name": "Casey Hicks",
        "role": "Staff",
        "image": "casey-hicks.jpg",
        "bio": "Casey Hicks is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in scientists. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Casey Hicks collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "kelly-williamson-phd",
        "name": "Kelly Williamson, PhD",
        "role": "Staff",
        "image": "kelly-williamson-phd.jpg",
        "bio": "Kelly Williamson, PhD is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Kelly Williamson, PhD collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nKelly Williamson, PhD has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "kestrel-merritt",
        "name": "Kestrel Merritt",
        "role": "Staff",
        "image": "kestrel-merritt.jpg",
        "bio": "Kestrel Merritt is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Kestrel Merritt collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nKestrel Merritt has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "laith-al-khraisat",
        "name": "Laith Al Khraisat",
        "role": "Staff",
        "image": "laith-al-khraisat.jpg",
        "bio": "Laith Al Khraisat is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Laith Al Khraisat collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "refael-munitz",
        "name": "Refael Munitz",
        "role": "Staff",
        "image": "refael-munitz.jpg",
        "bio": "Refael Munitz is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Refael Munitz collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nRefael Munitz has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "scott-donahue",
        "name": "Scott Donahue",
        "role": "Staff",
        "image": "scott-donahue.jpg",
        "bio": "Scott Donahue is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Scott Donahue collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements."
    },
    {
        "id": "tirzah-griffin",
        "name": "Tirzah Griffin",
        "role": "Staff",
        "image": "tirzah-griffin.jpg",
        "bio": "Tirzah Griffin is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Tirzah Griffin collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nTirzah Griffin has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    },
    {
        "id": "victor-young",
        "name": "Victor Young",
        "role": "Staff",
        "image": "victor-young.jpg",
        "bio": "Victor Young is a dedicated member of the Trauma and Transfusion Medicine Research Laboratory, where they contribute to cutting-edge investigations in staff. Their work supports the lab’s mission to improve outcomes for critically injured patients through innovation and discovery.\n\nIn addition to their research responsibilities, Victor Young collaborates closely with other departments and contributes to interdisciplinary initiatives across the university. They are passionate about scientific rigor, collaboration, and translating lab findings into meaningful clinical improvements.\n\nVictor Young has presented their work at conferences and has been actively involved in mentoring junior researchers and students. They are enthusiastic about fostering a supportive and inclusive research environment."
    }
]